## Plan Result (ithc-global)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc"
        name                                 = "hmcts-ithc"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-dss-update-case"
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/backendPools/fis-ds-update-web"
          ~ load_balancing_name = "loadBalancingSettings-fis-ds-update-web" -> "loadBalancingSettings-dss-update-case"
          ~ name                = "fis-ds-update-web" -> "dss-update-case"

            # (1 unchanged block hidden)
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/healthProbeSettings/healthProbeSettings-fis-ds-update-web"
          ~ name                = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-dss-update-case"
            # (5 unchanged attributes hidden)
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/loadBalancingSettings/loadBalancingSettings-fis-ds-update-web"
          ~ name                            = "loadBalancingSettings-fis-ds-update-web" -> "loadBalancingSettings-dss-update-case"
            # (3 unchanged attributes hidden)
        }

      ~ frontend_endpoint {
            id                                      = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/fis-ds-update-web"
          ~ name                                    = "fis-ds-update-web" -> "dss-update-case"
          + web_application_firewall_policy_link_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dssupdatecaseithc"
            # (3 unchanged attributes hidden)
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-update-web",
              + "dss-update-case",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/fis-ds-update-web"
          ~ name               = "fis-ds-update-web" -> "dss-update-case"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "fis-ds-update-web" -> "dss-update-case"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-update-web",
              + "dss-update-case",
            ]
            id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/routingRules/fis-ds-update-webHttpsRedirect"
          ~ name               = "fis-ds-update-webHttpsRedirect" -> "dss-update-caseHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (237 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dss-update-case"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc/frontendEndpoints/dss-update-case"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoors/hmcts-ithc|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1477,"Program":"tfcmt","SHA1":"","Target":"ithc-global","Vars":{}} -->